#ifndef TASK_2_H_INCLUDED
#define TASK_2_H_INCLUDED
/*
Вам необходимо составить программу, которая, не используя функций библиотеки stdlib.h, выделяет память
для динамического массива, размерность которого вводится с консоли. Массив также заполняется с консоли,
далее заполненный массив выводится на консоль поэлементно в строку. После вывода массива надо освободить память,
не пользуясь функцией стандартной библиотеки по работе с памятью, далее заново попробовать вывести этот массив.
*/


#endif // TASK_2_H_INCLUDED
