#include "task_1.h"
/*
Вам необходимо составить программу, которая с помощью функций библиотеки stdlib.h выделяет память
для динамического массива, размерность которого вводится с консоли. Массив также заполняется с консоли,
далее заполненный массив выводится на консоль поэлементно в строку. После вывода массива необходимо
освободить память функцией из stdlib.h, далее заново попробовать вывести этот массив.
*/

unsigned int user=0;     //Переменная для ввода размерности массива



//double num_array[num];

